**EXPLORATORY DATA ANALYSIS**

In [34]:
#Importing necessary libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [35]:
# Importing the dataset
data = pd.read_csv('employees_data.csv', index_col=0)
# Displaying the first two rows of the dataset
data.head(2)

# Displaying information about the dataset
data.info()
data.describe()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        6 non-null      object
 1   age         6 non-null      int64
 2   height      6 non-null      float64
 3   gender      6 non-null      object
 4   city        6 non-null      object
 5   salary      6 non-null      int64
 6   department  6 non-null      object
dtypes: float64(1), int64(2), object(4)
memory usage: 384.0+ bytes

             age    height        salary
count   6.000000  6.000000      6.000000
mean   35.166667  5.833333   7500.000000
std     6.675827  0.216025   1870.828693
min    25.000000  5.500000   5000.000000
25%    31.250000  5.725000   6250.000000
50%    36.500000  5.850000   7500.000000
75%    39.500000  5.975000   8750.000000
max    43.000000  6.100000  10000.000000

In [ ]:
# Compter le nombre de sexes diff√©rents
# data.value_counts('gender')
data['gender'].value_counts()

gender
M    4
F    2
Name: count, dtype: int64